mini2={
	--开始战斗的按钮
	startFight={{1581, 1061, 1696, 1205}, 
"0|0|0xf8e9ad,21|0|0xf8e9ad,71|-77|0xfad269,70|-45|0xe7b853,112|17|0xe3d59e,138|31|0xbbb082,195|25|0xcdc18f,195|39|0xa39972",
95, 0, 0, 0},
	
	--自动战斗得三角形
	tangle={{390, 1408, 465, 1493}, 
"0|0|0xffffff,0|10|0xffffff,0|19|0xffffff,-366|-13|0xffffff,-378|9|0xffffff,-371|31|0xffffff,-343|39|0xffffff,-326|-48|0xffffff,-283|3|0xffffff,60|56|0xffffff",
95, 0, 0, 0},
	
	--战斗齿轮
	gear={{32, 1410, 136, 1494}, 
"0|0|0xffffff,-12|25|0xffffff,3|50|0xffffff,87|42|0xffffff,38|-34|0xffffff,184|-34|0xffffff,136|17|0xffffff,183|85|0xffffff,307|18|0xffffff",
95, 0, 0, 0},
	
	--胜利和rgb
	victoryRGB={{873, 256, 1090, 415}, 
"0|0|0xffff37,2|48|0xfff7b8,74|94|0xffb504,150|50|0xfffce9,147|6|0xffff34,-386|489|0x002a74,101|470|0xf7ce66,605|472|0xd61645,-435|473|0x00a4ef,595|505|0xf54373",
95, 0, 0, 0},
	
	
	--胜利标记
	victory={{872, 267, 1118, 410}, 
"0|0|0xfefd36,2|33|0xfff730,1|76|0xffc70d,74|2|0xffff30,75|22|0xfffc32,74|92|0xffb704,152|4|0xffff33,150|47|0xfffded,196|15|0xffff36,221|90|0xffb600",
95, 0, 0, 0},
	
	--RGB标记
	rgb={{438, 710, 578, 831}, 
"0|0|0x00a4ef,1|33|0x0a7ad1,23|43|0x034193,545|-15|0xfbd670,535|24|0xf3c861,530|43|0xe6b751,1024|-11|0xffdeec,1034|4|0xd51545,1031|36|0xf64b7b",
95, 0, 0, 0},
	
	--获得奖励确认
	confirmReward={{722, 734, 1315, 1444}, 
"0|0|0xf4e5a9,10|0|0xf4e5a9,20|13|0xf4e5a9,17|36|0xf3e4a8,66|30|0xf4e5a9,85|-2|0xf4e5a9,92|34|0xf4e5a9,98|39|0xf4e5a9,123|-8|0xca9f57,-55|8|0xc99a54",
95, 0, 0, 0},
	
	--出售符文
	saleRune={{641, 894, 1027, 1497}, 
"0|0|0xf4e5a9,2|13|0xf4e5a9,29|12|0xf4e5a9,67|-4|0xf4e5a9,68|10|0xe8d99e,66|18|0xf4e5a9,77|33|0xf4e5a9,320|26|0xf4e5a9,335|25|0xf4e5a9,354|25|0xf4e5a9",
95, 0, 0, 0},
	
	--确认出售符文
	confirmSaleRune={},
	
	--保留符文
	keepRune={{1050, 838, 1290, 1501}, 
"0|0|0xf4e5a9,12|0|0xf4e5a9,39|0|0xf4e5a9,116|4|0xf4e5a9,129|2|0xf4e5a9,183|28|0xf4e5a9,-308|-30|0xf4e5a9,-309|-11|0xf4e5a9,-309|5|0xf4e5a9,-321|6|0xf4e5a9",
95, 0, 0, 0},
	
	--再来一次
	again={},
	
	--死了不复活
	noRevive={{1309, 900, 1411, 1032}, 
"0|0|0xf8e9ad,20|0|0xf8e9ad,36|1|0xf8e9ad,34|49|0xf8e9ad,7|-162|0xffffff,16|-189|0xffffff,-450|-194|0xffffff,-325|-182|0xffffff,-673|-176|0xffffff,-567|-163|0xffffff",
95, 0, 0, 0},
	
	--失败+rgb
	defeat={{886, 269, 1008, 408}, 
"0|0|0xffff3a,30|35|0xd1df33,61|69|0x92b232,110|63|0xa3bf3f,-424|464|0x4cb3f5,-431|497|0x073f8e,95|444|0xfad36a,88|481|0xefc159,589|453|0xd81344,569|489|0xf43768",
95, 0, 0, 0},
	
	--准备战斗
	prepareBattle={{434, 782, 505, 867}, 
"0|0|0xf8e9ad,8|24|0xf8e9ad,83|23|0xf8e9ad,83|36|0xf8e9ad,847|0|0xf8e9ad,853|11|0xf8e9ad,868|20|0xf8e9ad,919|5|0xf8e9ad,910|29|0xf8e9ad",
95, 0, 0, 0},
	
	--打开商店
	openStore={},
	
	--点击体力
	clickEnerge={},
	
	--确认购买体力,按钮是
	buyEnerge={{857, 759, 1205, 1047}, 
"0|0|0xf8e9ad,12|-1|0xf7e8ac,27|0|0xf8e9ad,33|17|0xf8e9ad,33|43|0xf8e9ad,66|14|0xf8e9ad,92|-3|0xf8e9ad,85|33|0xf8e9ad,106|40|0xf8e9ad",
95, 0, 0, 0},
	
	--购买成功确认
	finishBuyConfirm={},
	--关闭商店
	closeStore={}
}


return mini2
