mix2={
	--开始战斗的按钮
	startFight={{1566, 689, 1889, 896}, 
"0|0|0xf8e9ad,11|-1|0xf8e9ad,29|-2|0xf6e7ab,24|23|0xcfc290,55|11|0xf7e8ac,97|6|0xf8e9ad,147|0|0xf8e9ad,151|3|0xf8e9ad,163|-1|0xf8e9ad,163|20|0xdcce99",
87, 0, 0, 0},
	
	--自动战斗得三角形
	tangle={{283, 938, 422, 1076}, 
"0|0|0xffffff,0|15|0xffffff,-1|25|0xffffff,-47|-29|0xffffff,-51|10|0xffffff,-22|60|0xffffff,-273|-38|0xffffff,-269|2|0xffffff,-269|27|0xffffff,-191|13|0xffffff",
87, 0, 0, 0},
	
	--战斗齿轮
	gear={{11, 950, 128, 1062}, 
"0|0|0xffffff,-10|23|0xffffff,-2|40|0xffffff,20|47|0xffffff,39|40|0xffffff,49|22|0xffffff,-19|-28|0xffffff,53|-27|0xffffff,71|18|0xffffff,33|71|0xffffff",
87, 0, 0, 0},
	
	--胜利和rgb
	victoryRGB={{825, 91, 1177, 368}, 
"0|0|0xffff34,0|21|0xfff92f,37|12|0xfffe33,-390|398|0x4cb2f4,-388|421|0x4b9be6,139|385|0xfad36a,139|414|0xf5ca63,662|397|0xd91243,659|423|0xf54373,160|37|0xfffbdf",
87, 0, 0, 0},
	
	--胜利标记
	victory={{825, 91, 1177, 368}, 
"0|0|0xffff35,0|23|0xfff92f,-1|42|0xfcec7a,59|-5|0xffff3d,60|21|0xfff82d,60|39|0xfffbe5,120|-4|0xffff4d,134|-3|0xffff34,158|2|0xfcfc32,159|34|0xfff9c7",
87, 0, 0, 0},
	
	--RGB标记
	rgb={{413, 432, 733, 651}, 
"0|0|0x002f7b,-13|-4|0x3da2f1,-22|19|0x0c3d8a,518|-31|0xfbd97a,505|-8|0xf8cf67,513|19|0xe9bb55,1042|-19|0xde0d3f,1040|-1|0xe42456,1036|16|0xf74c7b",
87, 0, 0, 0},
	
	--获得奖励确认
	confirmReward={{857, 472, 1170, 1065}, 
"0|0|0xf4e5a9,6|0|0xf4e5a9,-2|15|0xf4e5a9,-1|28|0xf4e5a9,33|9|0xf4e5a9,33|23|0xf4e5a9,67|-2|0xf4e5a9,68|9|0xf4e5a9,74|25|0xf4e5a9",
87, 0, 0, 0},
	
	--出售符文
	saleRune={{708, 543, 987, 1071}, 
"0|0|0xf4e5a9,0|9|0xf4e5a9,-9|10|0xf4e5a9,8|11|0xf4e5a9,255|23|0xf4e5a9,272|22|0xf4e5a9,288|22|0xf4e5a9,314|21|0xf4e5a9,325|25|0xe8d89e,323|19|0xf4e5a9",
87, 0, 0, 0},
	
	--确认出售符文
	confirmSaleRune={{719, 473, 950, 809}, 
"0|0|0xf8e9ad,15|-2|0xf8e9ad,27|-1|0xf8e9ad,14|12|0xf8e9ad,14|20|0xf8e9ad,-3|19|0xf8e9ad,334|0|0xf8e9ad,354|0|0xf8e9ad,369|-1|0xf8e9ad,351|15|0xf8e9ad",
87, 0, 0, 0},
	
	
	keepRune={{1046, 470, 1287, 1070}, 
"0|0|0xf4e5a9,-377|-46|0xf4e5a9,-386|-45|0xf4e5a9,-369|-44|0xf4e5a9,-122|-32|0xf4e5a9,-105|-33|0xf4e5a9,-89|-33|0xf4e5a9,-63|-34|0xf4e5a9,-52|-30|0xe8d89e,-54|-36|0xf4e5a9",
87, 0, 0, 0},
	
	--再来一次
	again={{455, 490, 860, 725}, 
"0|0|0xf8e9ad,17|0|0xf8e9ad,31|0|0xf8e9ad,94|16|0xf8e9ad,108|15|0xf8e9ad,125|16|0xf8e9ad,19|25|0xf8e9ad,-2|25|0xf8e9ad,34|25|0xf8e9ad,3|11|0xf8e9ad",
87, 0, 0, 0},
	
	--死了不复活
	noRevive={{1156, 586, 1426, 821}, 
"0|0|0xf8e9ad,17|-1|0xf8e9ad,35|-1|0xf8e9ad,16|14|0xf8e9ad,-597|11|0xfdfdfd,-597|27|0xfdfdfd,-577|14|0xfdfdfd,-575|30|0xfdfdfd,-626|14|0xe02051,-634|26|0xf1386a",
87, 0, 0, 0},
	
	--失败+rgb
	defeat={{840, 72, 1151, 242}, 
"0|0|0xffff32,26|13|0xf8fa34,26|13|0xf8fa34,82|-1|0xffff3a,-401|398|0x3ea3f1,-389|406|0x00337f,128|376|0xfad36a,125|411|0xf5cb64,653|386|0xda0639,646|413|0xee3364",
87, 0, 0, 0},
	
	--准备战斗
	prepareBattle={{1123, 772, 1362, 1004}, 
"0|0|0xffffe0,38|0|0xffffef,23|-15|0x8e340e,1|-30|0x8e340e,35|-28|0x8e340e,18|19|0x8e340e,-46|67|0xffffff,2|66|0xffffff,2|95|0xffffff,35|73|0xffffff",
87, 0, 0, 0},
	
	--打开商店
	openStore={{671, 585, 883, 754},
		"0|0|0xf8e9ad,9|-2|0xf8e9ad,25|-1|0xf8e9ad,220|-281|0xe2c582,236|-282|0xe2c582,249|-281|0xe2c582,142|-92|0x482e1f,43|-168|0x482e1f,68|8|0xf8e9ad",
		85, 0, 0, 0},
	
	--点击体力
	clickEnerge={{557, 324, 1038, 719},
		"0|0|0xf7cf68,-7|29|0xf6cd65,-11|74|0xecbf5a,-25|316|0xdf2151,-38|327|0xf2537f,-28|333|0xf95c89,35|-10|0xfcd36d",
		87, 0, 0, 0},
	
	--确认购买体力,按钮是
	buyEnerge={{695, 593, 877, 729},
		"0|0|0xf8e9ad,0|9|0xf8e9ad,16|11|0xf8e9ad,16|6|0xf8e8ad,18|-242|0xf8e9ad,33|-240|0xf8e9ad,49|-242|0xf7e8ac,63|-211|0xf8e9ad,72|-210|0xf8e9ad",
		85, 0, 0, 0},
	
	--购买成功确认
	finishBuyConfirm={{815, 553, 1143, 753},
		"0|0|0xf8e9ad,6|0|0xf8e9ad,12|0|0xf8e9ad,17|-1|0x412702,22|1|0xf8e9ad,33|1|0xf8e9ad,26|5|0x412702,28|9|0xf8e9ad,23|14|0x412702",
		85, 0, 0, 0},
	
	--关闭商店
	closeStore={{781, 813, 1128, 1054},
		"0|0|0xf8f0cf,7|6|0xf8f0cf,9|17|0xf8f0cf,-6|32|0xf8f0cf,24|31|0xf8f0cf,38|-3|0xf8f0cf,-168|-143|0xdb1c4c,-174|-132|0xeb2d5f,-592|-138|0xcd1d03",
		87, 0, 0, 0},
	
	--小boss
	littleBoss={{45, 134, 124, 183}, 
"0|0|0x55372a,15|0|0x54362a,30|1|0x503327,7|-17|0xfaf4e0,9|14|0xded4b6,1|803|0xffffff,-44|806|0xffffff,-51|847|0xffffff,-19|901|0xffffff",
95, 0, 0, 0},
	
	bigBoss={{41, 205, 131, 275}, 
"0|0|0x55362a,16|1|0x533529,31|1|0x513428,23|10|0xeaddc4,6|9|0xf3e6d1,-15|717|0xffffff,22|767|0xffffff,2|784|0xffffff,-49|802|0xffffff",
87, 0, 0, 0},
	
	nextStage={{541, 542, 722, 644}, 
"0|0|0xf8e9ad,10|2|0xf8e9ad,10|15|0xf8e9ad,45|15|0xf8e9ad,71|15|0xf8e9ad,357|-407|0xfff62e,416|-413|0xfffb32,415|-385|0xffee97",
87, 0, 0, 0
	},
	
	-----合成
	--合成按钮
	synthesis={{484, 892, 736, 1025},
		"0|0|0xfdf2c5,-10|11|0xfdf2c5,-1|10|0x412702,3|15|0xfdf2c5,-87|-629|0xc68f2e,-108|-619|0xd19932,111|-634|0xcb9939,122|-620|0xc59031,105|-663|0xd3a543",
		87, 0, 0, 0
	},
	--确定合成
	confirmSynthesis={{654, 552, 942, 759},
		"0|0|0xf8e9ad,3|4|0x452b06,4|8|0xf3e4a8,5|10|0x412702,330|-198|0xe2c582,331|-204|0x563b28,329|-208|0xe2c582,249|-223|0x482e1f,250|-230|0xe2c582",
		87, 0, 0, 0
	},
	--合成成功
	synthesisOk={{890, 606, 1030, 707},
		"0|0|0xf8e9ad,8|0|0xf8e9ad,22|-2|0xf8e9ad,32|3|0xf8e9ad,44|-1|0xd2aa4e,53|-2|0xf8e9ad,59|5|0xf8e9ad,122|-206|0xe2c582,124|-201|0x482e1f,124|-195|0xe2c582",
		87, 0, 0, 0
	},
	
	-----
	pureDefeat={{852, 93, 1208, 309}, 
"0|0|0xfefe34,31|2|0xfcfc33,26|28|0xccdb33,86|-8|0xffff33,114|-9|0xffff33,139|-13|0xffff3a,129|15|0xe9f03c,154|24|0xd9e53d",
87, 0, 0, 0
	},
	
	--三星碎片 rb 聊天标记
	rbTalk={{398, 449, 613, 663},
		"0|0|0x0b84d7,-396|-399|0xfffff6,-388|-401|0x523529,-373|-401|0x523529,29|-17|0x46acf2,24|3|0x3e9bee,1011|-21|0xd51746,1007|8|0xf7507f,-404|-401|0x4e3024,-380|-399|0xfffadf",
		87, 0, 0, 0
	},
	
	--异界相关
	--队长 开始战斗的按钮
	owStartFight={{1681, 871, 1916, 1029}, 
"0|0|0xf8e9ad,44|1|0xf8e9ad,56|0|0xf8e9ad,67|-2|0xcda146,83|0|0xf8e9ad,99|-10|0xcda249,-1616|-944|0xf1eecf,-1600|-947|0xf1eecf,-1567|-947|0xf1eecf",
87, 0, 0, 0
	},
	
	--确认开始战斗
	owConfirmStartFight={{769, 584, 908, 720}, 
"0|0|0xf8e9ad,0|7|0xf8e9ad,27|6|0xf8e9ad,14|21|0xf8e9ad,14|37|0xf8e9ad,37|-232|0xe2c582,47|-232|0xe2c582,42|-212|0xe2c582,84|-180|0x482e1f,166|-176|0x482e1f",
87, 0, 0, 0
	},
	--战斗齿轮
	owGear={{8, 946, 140, 1069}, 
"0|0|0xffffff,65|28|0xffffff,31|100|0xffffff,-39|78|0xffffff,2|63|0xffffff,13|33|0xffffff,33|50|0xffffff,58|95|0xffffff",
87, 0, 0, 0
	},
	
	--胜利标记
	owVictory={{869, 87, 1169, 267}, 
"0|0|0xeee83b,16|-1|0xeee839,19|27|0xefde41,59|15|0xece63a,122|2|0xebe639,121|25|0xeddf40,180|2|0xede838",
87, 0, 0, 0
	},
	
	owDefeat={{866, 113, 1141, 287}, 
"0|0|0xffff32,-5|14|0xf7fa37,26|12|0xf9fb34,26|31|0xd7e335,83|-1|0xffff3a,113|0|0xffff38,135|9|0xfdfd36,153|10|0xfcfd41",
87, 0, 0, 0
	},
	
	owSameTeamAgain={{773, 598, 915, 706}, 
"0|0|0xf8e9ad,16|13|0xf8e9ad,14|22|0xf8e9ad,-99|-232|0xe2c582,-88|-226|0xe2c582,-16|-162|0x482e1f,39|5|0xd3ab51,47|30|0xc89b42",
87, 0, 0, 0
	},
	
	--队员准备战斗
	owReadyToFight={{1679, 936, 1914, 1021}, 
"0|0|0xcfa448,5|16|0xf8e9ad,17|15|0xf8e9ad,41|13|0xf8e9ad,104|14|0xf8e9ad,-1616|-934|0xf1eecf,-1603|-934|0xf1eecf,-1590|-929|0xf1eecf",
87, 0, 0, 0
	},
	
		--属性异界成绩结算
	eleOwSettlement={{805, 112, 1153, 276}, 
"0|0|0xffff33,3|33|0xffc60c,84|-2|0xfdfd35,165|1|0xffff54,-755|339|0xffecbc,-754|534|0xffe1b3,-760|548|0xffe2b4,-666|538|0xffe1b3",
87, 0, 0, 0
	},
	
	--属性异界成绩结算宝箱
	eleOwSettlementBox={{805, 112, 1153, 276}, 
"0|0|0xb3b23d,33|-1|0xb7b725,115|13|0xb7ad27,-707|331|0xb3ae8a,-723|340|0xafa07f,-722|532|0xb19c7d,-726|546|0xb19c7d,-728|554|0xb19c7d",
87, 0, 0, 0
	},
	
	--属性异界奖励确认
	eleOwRewardConfirm={{825, 757, 1206, 1036}, 
"0|0|0xf8e9ad,10|7|0xf8e9ad,19|15|0xf8e9ad,52|28|0xf8e9ad,-45|-681|0xffffff,-18|-694|0xffffff,21|-701|0xffffff,45|-699|0xffffff,76|-684|0xffffff",
87, 0, 0, 0}
	
}


return mix2
