mix3={
	--开始战斗的按钮
	startFight={{1705, 635, 2153, 909}, 
"0|0|0xffffff,9|0|0xffffff,23|16|0xf4f4f4,46|6|0xffffff,67|-2|0xffffff,89|-20|0xcfa64b,3|-15|0xd0a74b,162|-1|0xffffff,162|6|0xffffff",
87, 0, 0, 0},
	
	--自动战斗得三角形
	tangle={{304, 946, 404, 1063}, 
"0|0|0xffffff,0|5|0xffffff,-13|-19|0xffffff,-40|-47|0xffffff,34|-46|0xf0f0f0,53|1|0xffffff,-12|52|0xffffff,-150|50|0xffffff,-191|-3|0xffffff,-282|-48|0xffffff",
87, 0, 0, 0},
	
	--战斗齿轮
	gear={{10, 942, 131, 1068}, 
"0|0|0xffffff,43|7|0xffffff,47|47|0xffffff,9|36|0xffffff,-16|33|0xffffff,-20|58|0xffffff,-57|66|0xffffff,160|0|0xffffff,117|1|0xffffff,119|100|0xffffff",
87, 0, 0, 0},
	
	--胜利和rgb
	victoryRGB={{946, 88, 1228, 266}, 
"0|0|0xffff35,1|14|0xfffe2d,-1|35|0xfdf5a0,39|11|0xffff34,-410|394|0x0f78ab,-427|411|0x349bef,183|385|0xfad36b,179|420|0xf7ce66,796|394|0xdd1d4e,779|423|0xf54373",
87, 0, 0, 0},
	
	
	--胜利标记
	victory={{946, 88, 1228, 266}, 
"0|0|0xffff35,1|14|0xfffe2d,-1|35|0xfdf5a0,39|11|0xffff34,121|-2|0xffff38,122|15|0xfffd31,159|0|0xfefe33,180|5|0xffff35",
87, 0, 0, 0},
	
	--RGB标记
	rgb={{501, 473, 783, 611}, 
"0|0|0x45aaf2,-4|16|0x389df0,-31|28|0x0b7bd1,604|-11|0xfad36a,597|5|0xf8cd67,606|29|0xf1c45e,1212|-1|0xd61344,1207|14|0xe12052,1204|30|0xf54575",
87, 0, 0, 0},
	
	--获得奖励确认
	confirmReward={{846, 461, 1398, 1064}, 
"0|0|0xf4e5a9,5|0|0xf4e5a9,19|-1|0xf4e5a9,31|1|0xf4e5a9,26|9|0xf4e5a9,26|16|0xf4e5a9,60|33|0xf4e5a9,80|30|0xf4e5a9,70|0|0xf4e5a9",
87, 0, 0, 0},
	
	--出售符文
	saleRune={{706, 606, 1562, 1066}, 
"0|0|0xf4e5a9,1|13|0xf4e5a9,1|30|0xf4e5a9,30|23|0xf4e5a9,43|4|0xf4e5a9,264|25|0xf4e5a9,278|24|0xf4e5a9,307|21|0xf4e5a9,322|21|0xf4e5a9,322|28|0xf4e5a9",
87, 0, 0, 0},
	
	--确认出售符文
	confirmSaleRune={{722, 426, 1174, 966}, 
"0|0|0xf8e9ad,-1|6|0xf8e9ad,12|14|0xf8e9ad,28|21|0xf8e9ad,182|9|0x482e1f,177|40|0x482e1f,334|1|0xf8e9ad,350|1|0xf8e9ad,367|0|0xf8e9ad",
87, 0, 0, 0},
	
	--保留符文
	keepRune={{706, 606, 1562, 1066}, 
"0|0|0xf4e5a9,-349|-40|0xf4e5a9,-349|-23|0xf4e5a9,-320|-30|0xf4e5a9,-307|-49|0xf4e5a9,-86|-28|0xf4e5a9,-72|-29|0xf4e5a9,-43|-32|0xf4e5a9,-28|-32|0xf4e5a9,-28|-25|0xf4e5a9",
87, 0, 0, 0},
	
	--再来一次
	again={{574, 460, 962, 717}, 
"0|0|0xf8e9ad,0|9|0xf8e9ad,0|20|0xf8e9ad,80|15|0xf8e9ad,91|15|0xf8e9ad,104|15|0xf8e9ad,108|15|0xf8e9ad,140|4|0xf8e9ad,158|4|0xf8e9ad",
87, 0, 0, 0},
	
	--死了不复活
	noRevive={{1296, 581, 1546, 845}, 
"0|0|0xf8e9ad,18|0|0xf8e9ad,35|-1|0xf8e9ad,14|7|0xf8e9ad,-552|-165|0xffffff,-552|-157|0xffffff,-258|-131|0xffffff,-203|-163|0xffffff",
87, 0, 0, 0},
	
	--失败+rgb
	defeat={{988, 91, 1301, 330}, 
"0|0|0xffff44,-7|15|0xf9fb36,26|11|0xfdfd33,23|36|0xd1de33,-447|389|0x8ad0f9,-449|411|0x3ca2f1,166|381|0xfad36b,164|412|0xf3c962,777|391|0xda1a4b,765|415|0xf03568",
87, 0, 0, 0},
	
	--准备战斗
	prepareBattle={{1325, 790, 1634, 1024}, 
"0|0|0x8f340d,-18|7|0xffffe0,21|7|0xffffdf,-74|99|0xffffff,-62|96|0xffffff,-16|73|0xffffff,-16|93|0xffffff,32|95|0xffffff,32|103|0xffffff",
87, 0, 0, 0},
	
	--打开商店
	openStore={{797, 556, 1088, 772}, 
"0|0|0xf8e9ad,-9|1|0xf8e9ad,43|8|0xf8e9ad,223|-280|0xe2c582,265|-269|0xe2c582,346|-3|0xf8e9ad,346|9|0xf8e9ad,346|21|0xf8e9ad",
87, 0, 0, 0},
	
	--点击体力
	clickEnerge={{854, 401, 1065, 817}, 
"0|0|0xf6cd66,1|42|0xf7ce67,375|44|0xf4f6ff,404|28|0xf3f5fe,-26|309|0xda1a4b,390|308|0xd61545,809|311|0xda1c4b,852|59|0x44abf2,-465|313|0xd22103",
87, 0, 0, 0},
	
	--确认购买体力,按钮是
	buyEnerge={{894, 608, 1042, 737}, 
"0|0|0xf8e9ad,0|8|0xf8e9ad,25|0|0xf8e9ad,25|9|0xf8e9ad,13|24|0xf8e9ad,70|-240|0xf8e9ad,72|-232|0x412702,71|-225|0xf8e9ad,71|-217|0x442a0f",
87, 0, 0, 0},
	
	--购买成功确认
	finishBuyConfirm={{1039, 583, 1239, 732}, 
"0|0|0xf8e9ad,0|5|0xf8e9ad,-3|15|0xf8e9ad,33|13|0xf8e9ad,33|22|0xf8e9ad,-37|-234|0xe2c582,-37|-224|0xe2c582,-37|-213|0xe2c582,-41|-199|0x482e1f,18|-199|0x482e1f",
87, 0, 0, 0},
	--关闭商店
	closeStore={{969, 842, 1297, 1013}, 
"0|0|0xf8f0cf,7|3|0xf8f0cf,6|11|0xf8f0cf,53|7|0xf8f0cf,-173|-144|0xdf2050,247|-147|0xdb1b4b,239|-417|0xf3f5fe,-161|-442|0xf8cd67,-607|-142|0xd21f03,695|-400|0x57bdf6",
87, 0, 0, 0},
	
	--小boss
	littleBoss={{36, 124, 129, 192}, 
"0|0|0x55372a,15|0|0x54362a,29|0|0x54372b,9|-16|0xfbf4df,6|14|0xddcfb2,-31|802|0xffffff,-13|803|0xffffff,29|803|0xffffff,9|901|0xffffff,-28|900|0xffffff",
87, 0, 0, 0},
	
	bigBoss={{27, 200, 145, 283}, 
"0|0|0xf1e9d6,21|-1|0xf6ebd7,43|10|0xe6dabe,15|26|0xe0d3b8,16|11|0x53362a,0|11|0x55362a,29|11|0x533529,-30|729|0xffffff,-14|730|0xffffff,27|730|0xffffff",
87, 0, 0, 0},
	
	
	
	nextStage={{623, 670, 1004, 949},
		"0|0|0xf8e9ad,9|0|0xf8e9ad,20|-1|0xf8e9ad,45|-1|0xf8e9ad,21|11|0xf8e9ad,20|42|0xf8e9ad,59|20|0xf8e9ad,65|20|0xf8e9ad,85|20|0xf8e9ad,105|20|0xf8e9ad",
		90, 0, 0, 0},
	
	-----合成
	--合成按钮
	synthesis={
		{704, 1196, 921, 1326},
		"0|0|0xf0e4b8,10|-2|0xf7ebbf,20|0|0xf0e4b8,-3|10|0xfdf2c5,8|10|0xfdf2c5,22|10|0xfdf2c5,51|3|0xfdf2c5,62|2|0xfdf2c5,64|19|0xfdf2c5",
		90, 0, 0, 0
	},
	--确定合成
	confirmSynthesis={
		{936, 791, 1166, 955},
		"0|0|0xf8e9ad,33|7|0xf6e7ab,8|6|0xf8e9ad,36|13|0xf7e7ac,22|24|0xf8e9ad,20|34|0xf8e9ad,30|49|0xf4e4a9,447|-1|0xf8e9ad,469|-2|0xf8e9ad,451|-270|0xe2c582",
		90, 0, 0, 0
	},
	--合成成功
	synthesisOk={
		{1168, 814, 1344, 938},
		"0|0|0xf8e9ad,10|-1|0xf8e9ad,2|17|0xf8e9ad,3|45|0xf8e9ad,18|47|0xf8e9ad,30|34|0xf8e9ad,36|47|0xf8e9ad,99|2|0xf8e9ad,-23|-294|0xe2c582,15|-293|0xe0c381",
		90, 0, 0, 0
	},
	
	-----
	pureDefeat={
		{1102, 146, 1492, 372},
		"0|0|0xffff3a,-9|20|0xf8fb35,-16|45|0xd7e43d,21|46|0xd4e137,67|88|0x8fb133,106|43|0xdae736,124|-1|0xffff54,150|43|0xd9e538,187|76|0xa0bc32",
		90, 0, 0, 0
	},
	
	--三星碎片 rb 聊天标记
	rbTalk={{566, 644, 768, 791},
		"0|0|0x3ea4f1,-33|-20|0x00a4ef,-31|14|0x0b7ad0,1314|-15|0xda1b4a,1302|19|0xf64878,1289|-19|0xff8fbc,-572|-525|0x55362a,-551|-525|0x53362a,-571|-508|0xe8dbc2,-543|-508|0xe9dec1",
		90, 0, 0, 0
	},
	
	--异界相关
	--队长 开始战斗的按钮
	owStartFight={
		{2101, 1126, 2453, 1410},
		"0|0|0xefe0a5,0|10|0xf1e1a6,8|21|0xe4d69f,49|15|0xefe0a6,54|18|0xe3d49c,60|26|0xcbbd8b,80|24|0xd9cc98,98|18|0xeadba2,104|5|0xf7e8ac,111|37|0xc6963d",
		90, 0, 0, 0
	},
	
	--确认开始战斗
	owConfirmStartFight={
		{973, 804, 1152, 955},
		"0|0|0xf8e9ad,-1|18|0xf7e8ac,54|11|0xd1a950,227|-1|0x482e1f,419|3|0xd2ab4f,452|1|0xf8e9ad,422|-268|0xe2c582,374|-310|0xe2c582,42|25|0xf8e9ad,36|50|0xf8e9ad",
		90, 0, 0, 0
	},
	--战斗齿轮
	owGear={
		{14, 1260, 178, 1422},
		"0|0|0xffffff,30|-11|0xffffff,49|22|0xffffff,88|87|0xffffff,38|92|0xffffff,-30|81|0xfdfdfd,-39|-9|0xffffff,-20|-40|0xffffff,49|-39|0xffffff,30|48|0xffffff",
		90, 0, 0, 0
	},
	--胜利标记
	owVictory={
		{1116, 137, 1446, 399},
		"0|0|0xefea3e,-1|30|0xede235,-2|73|0xebc120,16|67|0xebc840,49|64|0xedd676,80|63|0xecd88e,102|63|0xecda95,75|103|0xeca912,212|107|0xeca50c,241|6|0xf0ea40",
		90, 0, 0, 0
	},
	owDefeat={
		{1117, 197, 1437, 379},
		"0|0|0xfefe30,-9|20|0xf7fa34,-17|43|0xdbe745,21|44|0xd7e43d,74|88|0x8daf32,107|94|0x88ab35,133|-2|0xffff52,185|-9|0xffff55,179|62|0xb3c930,214|94|0x85aa33",
		90, 0, 0, 0
	},
	owSameTeamAgain={
		{978, 807, 1113, 943},
		"0|0|0xf8e9ad,42|47|0xf8e9ad,120|18|0xcba148,239|22|0x482e1f,367|19|0xd0a549,447|-4|0xe8d89e,485|44|0xf8e9ad,603|-271|0xe2c582,-133|-315|0xd6ba7a,132|-290|0xe2c582",
		90, 0, 0, 0
	},
	
	--队员准备战斗
	owReadyToFight={
		{2134, 1170, 2266, 1367},
		"0|0|0xf8e8ad,0|32|0xb2a77c,60|0|0xf8e9ad,187|0|0xf8e8ad,155|-2|0xf6e7ab,169|25|0xcec190,190|25|0xcec190,138|-27|0xcea74d,103|-29|0xcfa64b",
		90, 0, 0, 0
	},
	
	--属性异界成绩结算
	eleOwSettlement={
		{992, 90, 1582, 404},
		"0|0|0xfefe80,28|0|0xffff7f,37|-7|0xfefd5b,107|15|0xf3f1a2,310|19|0xfcf870,-822|437|0xfef1c1,-829|459|0xfdedbd,-117|196|0xfffaeb,-109|159|0xfffaeb",
		85, 0, 0, 0
	},
	
	--属性异界成绩结算宝箱
	eleOwSettlementBox={
		{992, 90, 1582, 404},
		"0|0|0xb6b652,13|0|0xb0ae43,45|0|0xb6b625,156|-3|0xb1b023,-888|449|0xafa685,-889|459|0xafa482,-113|158|0xc2bfb4,-869|458|0xb5a381,-857|461|0xb3af8c",
		85, 0, 0, 0
	},
	
	--属性异界奖励确认
	eleOwRewardConfirm={
		{1071, 875, 1453, 1416},
		"0|0|0xf8e9ad,10|0|0xf8e9ad,30|2|0xf7e8ad,32|11|0xf8e9ad,48|12|0x412702,59|7|0x412702,62|1|0xf8e9ad,65|35|0xf8e9ad,86|17|0xf8e9ad",
		90, 0, 0, 0}

}


return mix3

